stirredReactor/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.001";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.0173235 0);
    }
    outlet
    {
        type            inletOutlet;
	phi		rhophi;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);
    }
    wall_rotor
    {
        type            noSlip;
    }
}


// ************************************************************************* //
