stirredReactor/0/alpha
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10.014385";
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
264782
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
21745
(
1
1
1
1
1
1
1
1
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 1;
    }
    outlet
    {
        type            calculated;
        value           uniform 1;
    }
    wall_rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
1913
(
1
1
1
1
1
1
0.908587
1
...
)
;
    }
}


// ************************************************************************* //
