stirredReactor/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.001";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 3.5;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        value           uniform 3.5;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 3.5;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 3.5;
    }
    wall_rotor
    {
        type            omegaWallFunction;
        value           uniform 3.5;
    }
}


// ************************************************************************* //
