stirredReactor/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     5.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear 1;
    grad(k)         cellMDLimited Gauss linear 1;
    grad(omega)     cellMDLimited Gauss linear 1;
    grad(epsilon)   cellMDLimited Gauss linear 1;

}

divSchemes
{
    default         none;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(alpharhophi,k)       Gauss upwind ;
    div(alpharhophi,epsilon) Gauss upwind ;
    div(alpharhophi,omega)   Gauss upwind ;
    div(alpharhophi,U)       Gauss upwind ;
    div(alpharhophi,K)       Gauss upwind ;
    div(alpharhophi,e)       Gauss upwind ;
    div(phiv,p)              Gauss upwind ;
    div(phiGByA,kinematicCloud:alpha) Gauss upwind;//
}

laplacianSchemes
{
    default         Gauss linear corrected ;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected ;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
