stirredReactor/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.001;
        smoother        DIC;
        nPreSweeps      1;
        nPostSweeps     2;
        nFinestSweeps   2;
        casheAgglomeration   on;
        agglomerator    faceAreaPair ;
        nCellslnCoarsestLevel 1000;
        mergeLevels     1;
    }

    p_rghFinal
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0;
        smoother        DIC;
        nPreSweeps      1 ;
        nFinestSweeps   2;
        nPostSweeps     2;
        casheAgglomeration   on;
        agglomerator    faceAreaPair ;
        nCellslnCoarsestLevel 1000;
        mergeLevels     1;
    }

    U
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-06 1e-06 1e-06);
        relTol          (1e-3 1e-3 1e-3);
    }

    UFinal
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-7 1e-7 1e-7);
        relTol          (0 0 0);
    }

    "(k|epsilon|omega)"
    {
        solver          smoothSolver;
        tolerance       1e-10;
        smoother        GaussSeidel;
    }

    "(k|epsilon|omega)Final"
    {
        solver          smoothSolver;
        tolerance       1e-10;
        smoother        GaussSeidel;
    }

    "(e|h)"
    {
        solver          smoothSolver;
        tolerance       1e-7;
        smoother        GaussSeidel;
    }

    "(e|h)Final"
    {
        solver          smoothSolver;
        tolerance       1e-8;
        smoother        GaussSeidel;
    }

    kinematicCloud:alpha
    {
        solver          smoothSolver;
        tolerance       1e-10;
        smoother        GaussSeidel;
    }
}

PIMPLE
{
    nOuterCorrectors 100;
    nCorrectors     3;
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;

    outerCorrectorResidualControl
    {
	U
        {
            relTol 0;
            tolerance 1e-3;
        }

	p_rgh
        {
            relTol 0;
            tolerance 1e-4;
        }
    }

}

relaxationFactors
{
    fields
    {
        p_rgh 1;
        p_rghFinal 1;
    }

    equations
    {
        U  0.5;
        UFinal 1;
        k  0.2;
	omega 0.2;
    }
}


// ************************************************************************* //
